{
  "about": "about",
  "skills": "skills",
  "projects": "projects",
  "contacts": "contacts",
  "download_cv": "Download CV",
  "click_download_cv": "Click to download the CV",
  "switch_theme": "Click to switch to {{tMode}}",
  "switch_lang": "Click to switch to {{tLang}}",
  "github_link": "Click to open GitHub repository",
  "open_sidebar": "Click to open the sidebar",
  "close_sidebar": "Click to close the sidebar",
  "dark_mode": "dark mode",
  "light_mode": "light mode",
  "en_lang": "English",
  "pt_lang": "Portuguese",
  "lang": "EN",
  "repository": "repository",
  "greetings": "Hi, I'm Paulo!",
  "abstract": "Highly skilled Senior Software Engineer with over 9 years of experience delivering innovative, scalable, and efficient software solutions. Proven track record in leading multidisciplinary teams and developing high-impact systems in banking, retail, and scientific sectors. Adept at leveraging cutting-edge web technologies, including React, TypeScript, and Next.js, to optimize performance and achieve business goals.",
  "education": "Education",
  "experience": "Work Experience",
  "master_title": "Master's Degree in Informatics Engineering",
  "master_institute": "University of Coimbra",
  "master_description": "Strengthened knowledge in different areas of Informatics Engineering, namely: Data Networks and Communication Engineering, Systems and Computation, Information Systems and Software Engineering.\nIn addition, generic skills in analysis and synthesis, written and oral communication, problem-solving approaches, critical thinking, decision-making group work, autonomous learning and practical application of theoretical knowledge were obtained.",
  "bachelor_title": "Bachelor's Degree in Informatics Engineering",
  "bachelor_institute": "University of Coimbra",
  "bachelor_description": "Knowledge gained that ensures a solid foundation in structural areas, such as Mathematics, Physics and Programming, besides specific areas of Informatics Engineering.\nValued skills and personal attitudes necessary to practice the profession, including scientific spirit and creativity, critical sense and responsibility, the ability to learn autonomously, to interact and work in groups and in interdisciplinary teams, and the ability to self-adapt, have communication skills and self-demand.",
  "intern_title": "Intern",
  "intern_institute": "iClio",
  "intern_description": "Software development internship focusing on family tree generation application.",
  "intern_achievements": [
    "Collected, analyzed, and specified functional requirements for family tree generation application.",
    "Designed and implemented the application architecture.",
    "Integrated the application with existing systems."
  ],
  "intern_technologies": ["JavaScript", "HTML", "CSS", "Git"],
  "sfw_eng_title": "Software Engineer",
  "sfw_eng_institute": "China Systems",
  "sfw_eng_description": "Worked on Eximbills Enterprise platform for trade finance automation.",
  "sfw_eng_achievements": [
    "Enhanced and maintained Eximbills Enterprise, a trade finance automation system aligned with SWIFT, UCP, and ISO20022 standards.",
    "Reduced client transaction processing costs through real-time automation and auditing.",
    "Assumed leadership roles in task allocation, team training, and managing stakeholder expectations."
  ],
  "sfw_eng_technologies": ["React", "JavaScript", "HTML", "CSS", "XML", "Git"],
  "sr_eng_title": "Senior Engineer",
  "sr_eng_institute": "Critical Software",
  "sr_eng_description": "Focusing on software development for international research and luxury fashion projects.",
  "sr_eng_achievements": [
    "Engineered advanced software interfaces to manage data and operations for a high-profile international research and technology initiative.",
    "Developed critical modules for an online luxury fashion platform, leading to reduced operational costs and improved partner performance metrics.",
    "Led requirements analysis, project planning, and task prioritization while mentoring team members to ensure technical excellence."
  ],
  "sr_eng_technologies": [
    "TypeScript",
    "React",
    "NestJS",
    "Next.js",
    "MobX",
    "Zod",
    "Material UI",
    "Plotly",
    "Jest",
    "Cypress",
    "Tailwind CSS",
    "Git",
    "ESLint",
    "Prettier"
  ],
  "actual_date": "Present",
  "event_link": "Click to open {{institute}} webpage",
  "contacts_description": "Let's connect and discuss opportunities",
  "projects_under_construction": "The projects section is currently under development. In the meantime, feel free to check out my work and contributions on GitHub!",
  "coming_soon": "Coming Soon",
  "languages_frameworks": "Languages & Frameworks",
  "development_tools": "Development Tools",
  "methodologies_competencies": "Methodologies & Competencies",
  "agile_methodologies": "Agile Methodologies",
  "linux_environments": "Linux Environments",
  "problem_solving": "Problem-solving",
  "leadership_mentoring": "Leadership and Mentoring",
  "key_achievements": "Key Achievements",
  "technologies": "Technologies",
  "all": "All"
}
