{
  "about": "sobre",
  "skills": "competências",
  "projects": "projectos",
  "contacts": "contactos",
  "download_cv": "Descarregar CV",
  "click_download_cv": "Clique para descarregar o CV",
  "switch_theme": "Clique para mudar para o {{tMode}}",
  "switch_lang": "Clique para mudar para {{tLang}}",
  "github_link": "Clique para abrir o repositório GitHub",
  "open_sidebar": "Clique para abrir o painel lateral",
  "close_sidebar": "Clique para fechar o painel lateral",
  "dark_mode": "modo escuro",
  "light_mode": "modo claro",
  "en_lang": "Inglês",
  "pt_lang": "Português",
  "lang": "PT",
  "repository": "repositório",
  "greetings": "Olá, sou o Paulo!",
  "abstract": "Engenheiro de Software Sénior altamente qualificado, com mais de 9 anos de experiência a criar soluções de software inovadoras, escaláveis e eficientes. Histórico comprovado na liderança de equipas multidisciplinares e no desenvolvimento de sistemas de alto impacto nos setores bancário, retalhista e científico. Experiente em tecnologias web de ponta, incluindo React, TypeScript e Next.js, para otimizar desempenho e alcançar objetivos de negócio.",
  "education": "Educação",
  "experience": "Experiência Profissional",
  "master_title": "Mestrado em Engenharia Informática",
  "master_institute": "Universidade de Coimbra",
  "master_description": "Reforçados conhecimentos em diversas áreas da Engenharia Informática, nomeadamente: Engenharia de Redes de Comunicação, Sistemas e Computação, Sistemas de Informação e Engenharia de Software.\nAdicionalmente, foram adquiridas competências genéricas em análise e síntese, comunicação escrita e oral, capacidade de resolução de problemas, raciocínio crítico, capacidade de decisão, trabalho em grupo, aprendizagem autónoma e aplicação prática de conhecimentos teóricos.",
  "bachelor_title": "Licenciatura em Engenharia Informática",
  "bachelor_institute": "Universidade de Coimbra",
  "bachelor_description": "Adquiridos conhecimentos que asseguram uma formação de base sólida em áreas estruturantes, tais como a Matemática, a Física e a Programação, para além de áreas específicas da Engenharia Informática.\nValorizadas competências e atitudes pessoais necessárias ao exercício da profissão, nomeadamente: espírito científico e criativo, sentido crítico e responsabilidade, capacidade de aprender com autonomia, de interagir e trabalhar em grupos e em equipas interdisciplinares, e a capacidade de se auto-adaptar, ter habilidades de comunicação e auto-exigência.",
  "intern_title": "Estagiário",
  "intern_institute": "iClio",
  "intern_description": "Estágio com foco em desenvolver um software para geração de àrvores genealógicas.",
  "intern_achievements": [
    "Recolha, análise e especificação dos requisitos funcionais da aplicação de geração de árvores genealógicas.",
    "Desenho e implementação da arquitectura da aplicação.",
    "Integração da aplicação com os sistemas existentes."
  ],
  "intern_technologies": ["JavaScript", "HTML", "CSS", "Git"],
  "sfw_eng_title": "Engenheiro de Software",
  "sfw_eng_institute": "China Systems",
  "sfw_eng_description": "Trabalho desenvolvido no software Eximbills Enterprise, sistema integrado que automatiza e audita todo o ciclo de trade finance.",
  "sfw_eng_achievements": [
    "Desenvolvimento e otimização do Eximbills Enterprise, sistema integrado que automatiza e audita todo o ciclo de trade finance.",
    "Custos reduzidos de processamento de transações de clientes, através de automação e auditoria em tempo real.",
    "Assumidas funções de liderança em alocação de tarefas, formação de equipa e gestão de expectativas."
  ],
  "sfw_eng_technologies": ["React", "JavaScript", "HTML", "CSS", "XML", "Git"],
  "sr_eng_title": "Engenheiro Sénior",
  "sr_eng_institute": "Critical Software",
  "sr_eng_description": "Desenvolvimento de software para projetos de investigação internacional e moda de luxo.",
  "sr_eng_achievements": [
    "Desenhados e desenvolvidos interfaces de software para gestão de dados e operações num projeto internacional de investigação de grande escala.",
    "Criação e manutenção de módulos críticos para uma plataforma online do segmento de moda de luxo, reduzindo custos operacionais e melhorando o desempenho dos parceiros.",
    "Realizadas análises de requisitos, planeamento e priorização de tarefas, além de mentoria de membros da equipa"
  ],
  "sr_eng_technologies": [
    "TypeScript",
    "React",
    "NestJS",
    "Next.js",
    "MobX",
    "Zod",
    "Material UI",
    "Plotly",
    "Jest",
    "Cypress",
    "Tailwind CSS",
    "Git",
    "ESLint",
    "Prettier"
  ],
  "actual_date": "Presente",
  "event_link": "Clique para abrir a página de {{institute}}",
  "contacts_description": "Vamos conectar-nos e discutir oportunidades",
  "projects_under_construction": "Esta secção está actualmente em desenvolvimento. Entretanto, sinta-se à vontade para espreitar o meu trabalho e contribuições no GitHub!",
  "coming_soon": "Em Breve",
  "languages_frameworks": "Linguagens e Bibliotecas",
  "development_tools": "Ferramentas de Desenvolvimento",
  "methodologies_competencies": "Metodologias e Competências",
  "agile_methodologies": "Metodologias Ágeis",
  "linux_environments": "Ambientes Linux",
  "problem_solving": "Resolução de Problemas",
  "leadership_mentoring": "Liderança e Mentoria",
  "key_achievements": "Principais Conquistas",
  "technologies": "Tecnologias",
  "all": "Tudo"
}
